
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"82c9d89a75b39dc3d9c2d90025469f2dfc051989b519982612e3d21c51c90abf\"" -> "W/\"01868c83aea320109557d75f4394608fd84188180cef5b419579d33122939319\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"dbdfa24213e254fd779e581b802c4363ba96240004cabb830d950fa87bfcc22d\"" -> "W/\"058e395c4ea7d7c8b6cfa916d9253ae01d67e7940e320489401ac2ab4922a16b\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"912d6685c46bf7c06cc6b3dadc09193bc2e30a4a663a656ad37d0e8fae4a5313\"" -> "W/\"dd5b1b30ab884a04772852b9d369b1d3d6cb3f5428ea11baf44560e7e5e02bc6\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7bcc7117625ce1cffa8b62a092d546dc3d27cdce4b9ba8d3b6815c013580873c\"" -> "W/\"e86f726de0f80697a8f72b23639d0ec179fa6ed294379f1c1223c27bdb3291c5\""
        id          = "1393928"
        name        = "protect-main-branch-kong-build-images-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"2182b0f65de4513b4f11d990d67ef57e77355da87564e0faf714c7a4cf026b3b\"" -> "W/\"258057e82d9ed0428498c8da602c065f09d79d74622d4cc668361f2e87332b83\""
        id          = "1393929"
        name        = "protect-main-branch-kong-development-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"6b85d0de73eb50f8ff410738be61e5808e530f8676a79b90861d21f73313d984\"" -> "W/\"121055a7fabbf8b88b688601251f2bdb5e8768f4f2b59484b6b5f9ad32ad3e65\""
        id          = "1393927"
        name        = "protect-main-branch-kong-openssl-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"585142780dcb43d9e056d4bba6232c6f076dad7f00b1b5daf672b08a21502d62\"" -> "W/\"ba398e7318558f69bc00eba7120fdab2b290eaf729331e53236bc4cb505472a9\""
        id          = "1393870"
        name        = "protect-main-branch-kong-package-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e1ce440a95951fff3f3e9a3c1bc788b2877340cfa6812ea0b9f03164b2e744ce\"" -> "W/\"c5c066deb74189bbb1da097f0a7d137ed31d920cefb0065503640fa44b1ba6e1\""
        id          = "1393918"
        name        = "protect-main-branch-kong-runtime-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c8ba424e5b3b13dcf818f7c3b3bfe7bd266daef5f052d4d4af70313f19d5e23c\"" -> "W/\"94737337dcc08a80efd2c16f4dc752677f624c3aa6dfd7d798e0109e7e3d5578\""
        id          = "1391897"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"eb345fa132a72bcc3b35452b20d82c33e5332972b84de744b4b266964c0723ce\"" -> "W/\"29a51c1eb1b6c05ca950e42dda4e3281f32a336aa5d662219ca81de10f0f0641\""
        id          = "1393934"
        name        = "protect-main-branch-template-1-github-release-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"4da2d37e81542ceedec9a5ff3863e0c2115438118d6375384431dfb665b427b5\"" -> "W/\"cd65ae4bdd39ded7801ed51a7ae974eb5e0ffbae56e63bdea3d2ce6c7c8cc611\""
        id          = "1393937"
        name        = "protect-main-branch-template-1-terraform-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"f9fcfd7c6f964b7e17a64483f66e74b6ea4eb3ea17103834d477cdd202992c87\"" -> "W/\"cd1b6b822afde9a7cf11b9f82febbef2a5806119b94152ab13667c9475b6ed9a\""
        id          = "1393936"
        name        = "protect-main-branch-template-template-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"3fc4d43fc6407e7779b650caf1b3c30ea09c074ac1a716e5639f3bf5527cab77\"" -> "W/\"dbf9e98407c218b604a83650747c10b2a9b154056447505dad0336eb19ffaca0\""
        id          = "1393924"
        name        = "protect-main-branch-kong-build-images-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"e6b5afb49b58cfaca8350c0b999566c6b4c7b19edde14bd35522abcfdfaaa2de\"" -> "W/\"1e1e87d53b5333d401d221648487d08a35263480294b6344be670f7daa9ede05\""
        id          = "1393926"
        name        = "protect-main-branch-kong-development-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"a9fd12678506182c32dcbc0202c76ec68f867f9f0be4c51de1234c570d8e5568\"" -> "W/\"0c4a2f86746e30ff79ad106d83fc73c7b3dced59e4b8f08ce2a40332db53a3e4\""
        id          = "1393925"
        name        = "protect-main-branch-kong-openssl-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"a410f9e23669244bdb2c0007345c92237598861d9a7ac6c483e5d5c71b55ee3d\"" -> "W/\"617d6841794ee1884825216a732839d496242618ebd5bc7321f031fc603c7a35\""
        id          = "1393871"
        name        = "protect-main-branch-kong-package-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"b451280c7082f47229d8c13ff290e0952c3b0d5bf6a0136e894cca5a13c65698\"" -> "W/\"dae681d8ed354d74aa1c9c7a282cf0a407b196b760304eebea27c2dbc426bc5b\""
        id          = "1393916"
        name        = "protect-main-branch-kong-runtime-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"0fc644846f1d7e77977ac4e230a648ac00568c46955c2b79ad445e3d496da66f\"" -> "W/\"a875fe45c1fcad1a5dde3278b2c3b6521fe2378bbfedff16f945c7be9f5ca6f5\""
        id          = "1393933"
        name        = "protect-main-branch-template-1-terraform-terraform-plan"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.settings_all["atc-router"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "atc-router"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["kong-openssl"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-openssl"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["kong-runtime"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-runtime"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["template-template"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "template-template"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-terraform-github-pre-commit"
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_terraform" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-terraform-github-terraform-plan"
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "terraform"
                  + integration_id = 0
                }
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->